---
kind: property
id: P:Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternAmount
source: html/4f39ffd7-c410-5a34-bcf7-d9d967be11c6.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternAmount Property

The property labeled "Amount" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public static string PlasticvinylPatternAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".